# ============================================================
# Generic Yosys synthesis script
# ============================================================

yosys -import

# ============================================================
# ============================================================
# ============================================================
# DC
set TOP     $::env(TOP)
set RTL     $::env(RTL)
set NETLIST $::env(NETLIST)
set LIB     $::env(LIB)

puts "============================================================"
puts "YOSYS SYNTHESIS"
puts "TOP     = $TOP"
puts "RTL     = $RTL"
puts "NETLIST = $NETLIST"
puts "LIB     = $LIB"
puts "============================================================"

# ============================================================
# ============================================================
# ============================================================

#read_liberty $LIB
read_verilog $RTL

synth -top $TOP

dfflibmap -liberty $LIB
abc -liberty $LIB

opt
clean

write_verilog $NETLIST

stat -liberty $LIB